In [334]:
import numpy as np
import pandas as pd
pd.__version__

'0.25.0'

In [335]:
pd.Series([1.23, 45, 653.4, "asd"], index=['a', 'b', 'c', 'd'])

a     1.23
b       45
c    653.4
d      asd
dtype: object

In [336]:
pop_dict={'gwl':2342342, "bpl":123123, "ind":111}
pop = pd.Series(pop_dict)
pop["bpl"]

123123

In [337]:
data = 1
index = ['a', 'b', 'c', 'd','e']
pd.Series(data = data, index=index) #series is sorted to index

a    1
b    1
c    1
d    1
e    1
dtype: int64

In [338]:
pd.DataFrame(pop, columns=["pop"])

         pop
gwl  2342342
bpl   123123
ind      111

In [339]:
pd.DataFrame({'a':i, 'b':i*2}for i in range(4))

   a  b
0  0  0
1  1  2
2  2  4
3  3  6

In [340]:
pd.DataFrame([{'a':2, 'b':1}, {'b':3, 'c':4}])

     a  b    c
0  2.0  1  NaN
1  NaN  3  4.0

In [341]:
pd.DataFrame(np.random.randint(10, size=(3, 2)), index=["a", "b", "c"], columns=["asd", "asddd"])

   asd  asddd
a    5      9
b    8      7
c    1      0

In [342]:
ind = pd.Index([1, 2, 4, 5, 677])
ind.shape, ind.ndim, ind.size

((5,), 1, 5)

In [343]:
'gwl' in pop
'a' in ind

False

In [344]:
pop['gwl'] = 89
pop.loc['gwl']
pop.iloc[1]
#don't name colums on data frame methods conflicts with attribute style access

123123

In [345]:
#pop.ix[:'gwl',:3]
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127}, name='population')
population/area #uninon of indices and NaN for uncommon
population.div(area, fill_value = area.mean())

Alaska         0.549896
California    90.413926
New York      20.736576
Texas         38.018740
dtype: float64

In [346]:
np.random.seed(23)
A = np.random.randint(10, size=(3, 4))
df = pd.DataFrame(A, columns=list('QRST'))
df-df.iloc[0]
df.subtract(df["R"], axis=0)

   Q  R  S  T
0 -3  0  2  3
1 -2  0 -1  1
2 -3  0 -5 -4

In [347]:
halfrow = df.iloc[0, ::2]
halfrow
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  3.0 NaN -1.0 NaN
2  0.0 NaN -7.0 NaN

In [348]:
pd.Series([1, np.nan, 2, None])
x = pd.Series(range(2), dtype=int)
x
x[0] = None
x# nan typecasts everything to float

0    NaN
1    1.0
dtype: float64

In [349]:
df = pd.DataFrame([[1, np.nan, 2],
                    [2, 3, 5],
                    [np.nan, 4, 6]])
df.dropna(how="all")
df.dropna(axis="columns")
df.dropna(axis=0, thresh=3)

     0    1  2
1  2.0  3.0  5

In [350]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [351]:
data.fillna(data.mean())
data.fillna(method="ffill")
data.fillna(method="bfill")
df.fillna(method="ffill", axis=1)

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [352]:
#bad way of hierarichal or multi-index
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [353]:
pop[("California", 2000):("New York", 2010)]
pop[[i for i in pop.index if i[1]==2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [354]:
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
index = pd.MultiIndex.from_tuples(index)
index #levels were not visible in the output for some reason?
#index??
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [355]:
#pop[:, 2010]
pop.unstack().stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [356]:
pop_df = pd.DataFrame({'total': pop,
'under18': [9267089, 9284094,
4687374, 4318033,
5906301, 6879014]})
pop_df
f_u18 = pop_df["under18"]/pop_df["total"]
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [357]:
#methods of multi index creation
df = pd.DataFrame(np.random.rand(4, 2),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=['data1', 'data2'])
df

        data1     data2
a 1  0.002465  0.884032
  2  0.884948  0.300410
b 1  0.589582  0.978427
  2  0.845094  0.065075

In [358]:
pd.MultiIndex.from_arrays([["a", "a", "b", "b"], [1, 2, 1, 2]])
pd.MultiIndex.from_arrays([("a", 1), ("a", 2), ("b", 1), ("b", 2), ("a", 1)])
pd.MultiIndex.from_product([["a", "b"],[1, 2, 3]])
#pd.MultiIndex(levels=[['a', 'b'], [1, 2]], labels=[[0, 0, 1, 1], [0, 1, 0, 1]])
pd.MultiIndex??

In [359]:
pop.index.names=["state", "year"]
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [360]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      27.0  36.0  41.0  38.1  19.0  36.1
     2      35.0  38.0  42.0  37.8  39.0  36.0
2014 1      36.0  38.3  39.0  35.8  51.0  37.5
     2      44.0  39.0  32.0  36.3  12.0  37.1

In [361]:
health_data["Sue"]
pop[pop>20000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [362]:
health_data["Guido", "HR"]
health_data.iloc[:2, :2]
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      27.0  41.0  19.0
2014 1      36.0  39.0  51.0

In [363]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.483055
      2      0.955740
c     1      0.901602
      2      0.505759
b     1      0.820701
      2      0.827716
dtype: float64

In [364]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

data.sort_index(inplace=True)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [365]:
data['a':'b']
pop.unstack(level=0)
pop.unstack(level=1)
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [366]:
pop_flat = pop.reset_index(name="population")
pop_flat
pop_flat.set_index(["year", "state"])

                 population
year state
2000 California    33871648
2010 California    37253956
2000 New York      18976457
2010 New York      19378102
2000 Texas         20851820
2010 Texas         25145561

In [367]:
data_mean = health_data.mean(level="year")
data_mean.mean(level="year", axis=0)

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     31.0  37.00  41.5  37.95  29.0  36.05
2014     40.0  38.65  35.5  36.05  31.5  37.30

In [368]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
    for c in cols}
    return pd.DataFrame(data, ind)

In [369]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[1, 5, 6])
try:
    pd.concat([ser1, ser2], verify_integrity=True)
except ValueError as e:
    #print(e)
    pass
    
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2], ignore_index=True)

print(ser1); print(ser2); print(pd.concat([ser1, ser2], keys=['x', 'y'])) #multiindex

1    A
2    B
3    C
dtype: object
4    D
5    E
6    F
dtype: object
x  1    A
   2    B
   3    C
y  4    D
   5    E
   6    F
dtype: object

In [370]:
#JOINS, JOIN_AXES
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
#print(df5); print(df6); print(pd.concat([df5, df6]))

#print(df5); print(df6); print(pd.concat([df5, df6], join="inner" ) )

'''Another option is to directly specify the index of the remaining colums using the
join_axes argument, which takes a list of index objects. Here we’ll specify that the
returned columns should be the same as those of the first input:'''

print(df5); print(df6); print(pd.concat([df5, df6], join_axes=[df5.columns] ) )

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

c:\users\abhishek\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:12: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  if sys.path[0] == '':

In [371]:
"""It also is not a very efficient method, because it
involves creation of a new index and data buffer. Thus, if you plan to do multiple
append operations, it is generally better to build a list of DataFrames and pass them all
at once to the concat() function."""
df5.append(df6, sort=True)

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [372]:
# merge

df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
'hire_date': [2004, 2008, 2012, 2014]})
#print(df1); print(df2)

#one to one join
df3 = pd.merge(df1, df2)
#print(df3)

#many to one join
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
'supervisor': ['Carly', 'Guido', 'Steve']})
#print(df4)
pd.merge(df3, df4)

#many to many
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
'Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux',
'spreadsheets', 'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [373]:
#on keyword for merging
#df1[4] = ("abhi", "Scientist") #cause of error - value eror = length mismatch
#df1.iloc[3].employee = "abhi" #abhi gayab ho jaega
#print(df1); print(df2); pd.merge(df1, df2, on='employee')

df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'salary': [70000, 80000, 120000, 90000]})
#print(df1); print(df3);
#print(pd.merge(df1, df3, left_on="employee", right_on="name"))

df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
#print(df1a); print(df2a); pd.merge(df1a, df2a, left_index=True, right_index=True)#must pass on or index both true

'''For convenience, DataFrames implement the join() method, which performs a
merge that defaults to joining on indices:'''
#print(df1a); print(df2a); print(df1a.join(df2a))

print(df1a); print(df3); pd.merge(df1a, df3, left_index=True, right_on='name')

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [374]:
# Arithmetic for joins
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
'food': ['fish', 'beans', 'bread']},
columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
'drink': ['wine', 'beer']},
columns=['name', 'drink'])
#print(df6); print(df7); print(pd.merge(df6, df7)) #or pd.merge(df6, df7, how="inner")
pd.merge(df6, df7, how="outer")
pd.merge(df6, df7, how="left")
pd.merge(df6, df7, how="right")

#SUFFIXES
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'rank': [3, 1, 4, 2]})
print(df8); print(df9); pd.merge(df8, df9, on="name")
pd.merge(df8, df9, on="name", suffixes=["_l", "+r"])#jitne hai exactly utne bhejne honge

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

   name  rank_l  rank+r
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [375]:
#!curl -O https://raw.githubusercontent.com/jakevdp/
# data-USstates/master/state-population.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/
# data-USstates/master/state-areas.csv
# !curl -O https://raw.githubusercontent.com/jakevdp/
# data-USstates/master/state-abbrevs.csv

# US DATA
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')
print(pop.head()); print(areas.head()); print(abbrevs.head())

'''Given this information, say we want to compute a relatively straightforward result:
rank US states and territories by their 2010 population density. We clearly have the
data here to find this result, but we’ll have to combine the datasets to get it.'''

pd.merge(pop, abbrevs, how="outer", left_on="state/region", right_on="abbreviation").drop("abbreviation", 1).head()
#continue but also check for mismatches

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

Aggregation Description
count() Total number of items
first(), last() First and last item
mean(), median() Mean and median
min(), max() Minimum and maximum
std(), var() Standard deviation and variance
mad() Mean absolute deviation
prod() Product of all items
sum() Sum of all items

In [376]:
#Groupby
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)}, columns=['key', 'data'])
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [377]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [378]:
planets.groupby('method')['orbital_period'].median()

#for(method, group) in planets.groupby('method'):
#    print("{0:30s} shape={1}".format(method, group.shape))

planets.groupby('method')["year"].describe().unstack()

       method
count  Astrometry                          2.0
       Eclipse Timing Variations           9.0
       Imaging                            38.0
       Microlensing                       23.0
       Orbital Brightness Modulation       3.0
                                         ...
max    Pulsar Timing                    2011.0
       Pulsation Timing Variations      2007.0
       Radial Velocity                  2014.0
       Transit                          2014.0
       Transit Timing Variations        2014.0
Length: 80, dtype: float64

In [379]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data1': range(6),
'data2': rng.randint(0, 10, 6)},
columns = ['key', 'data1', 'data2'])
df
df.groupby("key").aggregate([np.min, np.median, np.max])
df.groupby("key").aggregate({'data1':'min', 'data2':'max'})

def filter_func(x):
    return x['data2'].std() > 4

#print(df); print(df.groupby('key').std());
#df.groupby('key').filter(filter_func)

df.groupby('key').transform(lambda x: x - x.mean())

def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x
print(df); print(df.groupby('key').apply(norm_by_data2))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9
  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [380]:
#specifying splitkey
'''A list, array, series, or index providing the grouping keys. The key can be any series or list
with a length matching that of the DataFrame. For example:'''
L = [0, 1, 0, 1, 2, 0]
#print(df); print(df.groupby(L).sum())

'''A dictionary or series mapping index to group. Another method is to provide a dictionary
that maps index values to the group keys:'''
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
#print(df2); print(df2.groupby(mapping).sum())

'''Any Python function. Similar to mapping, you can pass any Python function that will
input the index value and output the group:'''
#print(df2); print(df2.groupby(str.lower).mean())

'''A list of valid keys. Further, any of the preceding key choices can be combined to
group on a multi-index:'''
df2.groupby([str.lower, mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonant    2.5    3.5
c consonant    3.5    6.0

In [381]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [382]:
#Pivot Tables
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [383]:
titanic.groupby('sex')[["survived"]].mean()
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()
#equivalent of ^ is 
titanic.pivot_table('survived', index='sex', columns='class')

age = pd.cut(titanic['age'], [0, 18, 80])
titanic.pivot_table('survived', ['sex', age], 'class')

fare = pd.qcut(titanic['fare'], 2)
titanic.pivot_table('survived', ['sex', age], [fare, 'class'])

#pd.cut?
#pd.qcut?

titanic.pivot_table(index='sex', columns='class', aggfunc={'survived':sum, 'fare':'mean'})

'''At times it’s useful to compute totals along each grouping. This can be done via the
margins keyword:'''
titanic.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [384]:
#birthrate data
# shell command to download the data:
#!curl -O https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv
births = pd.read_csv('births.csv')
births.head()
births['decade'] = 10 * (births['year'] // 10)
births.pivot_table('births', index='decade', columns='gender', aggfunc='sum')
#birthdata operations

gender         F         M
decade
1960     1753634   1846572
1970    16263075  17121550
1980    18310351  19243452
1990    19479454  20420553
2000    18229309  19106428

In [385]:
#vectorized string operations
data = ['peter', 'Paul', None, 'MARY', 'gUIDO']
names = pd.Series(data)
names.str.capitalize()

0    Peter
1     Paul
2     None
3     Mary
4    Guido
dtype: object

Here is a list of Pandas str methods that mirror Python string methods:
len() lower() translate() islower()
ljust() upper() startswith() isupper()
rjust() find() endswith() isnumeric()
center() rfind() isalnum() isdecimal()
zfill() index() isalpha() split()
strip() rindex() isdigit() rsplit()
rstrip() capitalize() isspace() partition()
lstrip() swapcase() istitle() rpartition()

Table 3-4. Mapping between Pandas methods and functions in Python’s re module
Method Description
match() Call re.match() on each element, returning a Boolean.
extract() Call re.match() on each element, returning matched groups as strings.
findall() Call re.findall() on each element.
replace() Replace occurrences of pattern with some other string.
contains() Call re.search() on each element, returning a Boolean.
count() Count occurrences of pattern.
split() Equivalent to str.split(), but accepts regexps.
rsplit() Equivalent to str.rsplit(), but accepts regexps.

Table 3-5. Other Pandas string methods
Method Description
get() Index each element
slice() Slice each element
slice_replace() Replace slice in each element with passed value
cat() Concatenate strings
repeat() Repeat values
normalize() Return Unicode form of string
pad() Add whitespace to left, right, or both sides of strings
wrap() Split long strings into lines with length less than a given width
join() Join strings in each element of the Series with passed separator
get_dummies() Extract dummy variables as a DataFrame

In [386]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
'Eric Idle', 'Terry Jones', 'Michael Palin'])
full_monte = pd.DataFrame({'name': monte,
'info': ['B|C|D', 'B|D', 'A|C', 'B|D', 'B|C',
'B|C|D']})
full_monte
#'''The get_dummies() routine lets you quickly split out these indicator variables into a DataFrame:'''
full_monte['info'].str.get_dummies('|')

   A  B  C  D
0  0  1  1  1
1  0  1  0  1
2  1  0  1  0
3  0  1  0  1
4  0  1  1  0
5  0  1  1  1

In [387]:
#recipe Database
#!curl -O http://openrecipes.s3.amazonaws.com/recipeitems-latest.json.gz
#!gunzip recipeitems-latest.json.gz

In [388]:
try:
    recipes = pd.read_json('recipeitems-latest.json')
except ValueError as e:
    print("ValueError:", e)
    
with open('recipeitems-latest.json') as f:
    line = f.readline()
#pd.read_json(line).shape

# read the entire file into a Python array
with open('recipeitems-latest.json', 'r') as f:
    # Extract each line
    data = (line.strip() for line in f)
    # Reformat so each line is the element of a list
    data_json = "[{0}]".format(','.join(data))
# read the result as a JSON
recipes = pd.read_json(data_json)

recipes.shape

#errorrrrrssssssssssssssssss unknown

ValueError: Expected object or value

(0, 0)

In [389]:
from datetime import datetime
datetime(year=2015, month=7, day=4)

from dateutil import parser
date = parser.parse("4th of July, 2015")
date

date.strftime("%B")# smaller for abbv

date = np.array('2015-07-04', dtype=np.datetime64)
date
date + np.arange(12)

np.datetime64('2015-07-04 12:59:59.50', 'ns')

date = pd.to_datetime('2015-07-04 12:59:59.50')
date
date + pd.to_timedelta(np.arange(12), 'h')

index = pd.DatetimeIndex(['2014-07-04', '2014-08-04',
'2015-07-04', '2015-08-04'])
data = pd.Series([0, 1, 2, 3], index=index)
data

pd.date_range('2015-07-03', '2015-07-10')
pd.date_range('2015-07-03', periods=8, freq='H')

pd.timedelta_range(0, periods=9, freq="2H30T")

from pandas.tseries.offsets import BDay
pd.date_range('2015-07-01', periods=5, freq=BDay())

DatetimeIndex(['2015-07-01', '2015-07-02', '2015-07-03', '2015-07-06',
               '2015-07-07'],
              dtype='datetime64[ns]', freq='B')

± 7.6e17 years [7.6e17 BC, 7.6e17 AD]
W Week ± 1.7e17 years [1.7e17 BC, 1.7e17 AD]
190 | Chapter 3: Data Manipulation with Pandas
Code Meaning Time span (relative) Time span (absolute)
D Day ± 2.5e16 years [2.5e16 BC, 2.5e16 AD]
h Hour ± 1.0e15 years [1.0e15 BC, 1.0e15 AD]
m Minute ± 1.7e13 years [1.7e13 BC, 1.7e13 AD]
s Second ± 2.9e12 years [ 2.9e9 BC, 2.9e9 AD]
ms Millisecond ± 2.9e9 years [ 2.9e6 BC, 2.9e6 AD]
us Microsecond ± 2.9e6 years [290301 BC, 294241 AD]
ns Nanosecond ± 292 years [ 1678 AD, 2262 AD]
ps Picosecond ± 106 days [ 1969 AD, 1970 AD]
fs Femtosecond ± 2.6 hours [ 1969 AD, 1970 AD]
as Attosecond ± 9.2 seconds [ 1969 AD, 1970 AD]

Table 3-7. Listing of Pandas frequency codes
Code Description Code Description
D Calendar day B Business day
W Weekly
M Month end BM Business month end
Q Quarter end BQ Business quarter end
A Year end BA Business year end
H Hours BH Business hours
T Minutes
S Seconds
L Milliseonds
U Microseconds
N Nanoseconds

In [390]:
#shifting, slicing, windowing

from pandas_datareader import data
goog = data.DataReader('GOOG', start='2004', end='2016',
data_source='google')
goog.head()

NotImplementedError: data_source='google' is not implemented

In [ ]:
#multiple datasets
# eval and query

In [391]:
390-334+1

57